In [2]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import os

In [63]:
?pd.crosstab
?pd.concat

In [5]:
df = pd.DataFrame({
    "country": ['India', 'India', 'India', 'India', 'Australia', 'Australia', 'Australia', 'SA', 'SA', 'India', 'India'],
    "state" : ['MP', 'MP', 'MP', 'UP', 'NSW', 'NSW', 'Victoria', 'Gauteng', 'Western Cape', 'Delhi','UP'],
    "city": ['Indore', 'Bhopal', 'Jabalpur', 'Lucknow', 'Sydney', 'Newcastle', 'Melbourne', 'Johannesburg', 'Cape Town', 'Delhi', 'Noida'],
    "sales": [150, 200, 100, 100, 200, 250, 300, 300, 200, 100, 50]
})

In [86]:
?df.rank

In [100]:
np.arange(1,10,2)

array([1, 3, 5, 7, 9])

In [118]:
df[['sales','rank','sales2']].describe()

            sales       rank      sales2
count   11.000000  11.000000   11.000000
mean   177.272727   2.272727   88.636364
std     84.745609   1.009050   42.372804
min     50.000000   1.000000   25.000000
25%    100.000000   1.500000   50.000000
50%    200.000000   2.000000  100.000000
75%    225.000000   3.000000  112.500000
max    300.000000   4.000000  150.000000

In [119]:
df1 = df[['sales','rank','sales2']]

In [190]:
x = ['sales','sales2','rank']
dff = pd.DataFrame()
for i,j in enumerate(x):
    df2 = df1.agg({j:[sum,np.mean, len, np.std, min, max]})
    if i == 0:
        dff = df2
    else:
        dff = pd.concat([dff,df2], axis=1)
#df1.agg({'sales':[sum,np.mean, len, np.std, min, max], 'sales2':np.mean})

In [191]:
dff

            sales      sales2       rank
sum   1950.000000  975.000000  25.000000
mean   177.272727   88.636364   2.272727
len     11.000000   11.000000  11.000000
std     84.745609   42.372804   1.009050
min     50.000000   25.000000   1.000000
max    300.000000  150.000000   4.000000

In [250]:
dfx = df[['country','city','sales']]
dfx

      country          city  sales
0       India        Indore    150
1       India        Bhopal    200
2       India      Jabalpur    100
3       India       Lucknow    100
4   Australia        Sydney    200
5   Australia     Newcastle    250
6   Australia     Melbourne    300
7          SA  Johannesburg    300
8          SA     Cape Town    200
9       India         Delhi    100
10      India         Noida     50

In [253]:
dfy = dfx.pivot_table(index='country',columns='city',values='sales').reset_index()

In [258]:
dfy.melt(id_vars='country',value_vars=['Bhopal', 'Cape Town', 'Delhi', 'Indore', 'Jabalpur','Johannesburg', 'Lucknow', 
    'Melbourne', 'Newcastle', 'Noida', 'Sydney'], var_name='city',value_name='sales').dropna()

      country          city  sales
1       India        Bhopal  200.0
5          SA     Cape Town  200.0
7       India         Delhi  100.0
10      India        Indore  150.0
13      India      Jabalpur  100.0
17         SA  Johannesburg  300.0
19      India       Lucknow  100.0
21  Australia     Melbourne  300.0
24  Australia     Newcastle  250.0
28      India         Noida   50.0
30  Australia        Sydney  200.0

In [256]:
dfy.columns

Index(['country', 'Bhopal', 'Cape Town', 'Delhi', 'Indore', 'Jabalpur',
       'Johannesburg', 'Lucknow', 'Melbourne', 'Newcastle', 'Noida', 'Sydney'],
      dtype='object', name='city')

In [260]:
y = df.pop('test')

In [263]:
df.values

array([['India', 'MP', 'Indore', 150, 2.0, 75.0],
       ['India', 'MP', 'Bhopal', 200, 1.0, 100.0],
       ['India', 'MP', 'Jabalpur', 100, 3.0, 50.0],
       ['India', 'UP', 'Lucknow', 100, 3.0, 50.0],
       ['Australia', 'NSW', 'Sydney', 200, 3.0, 100.0],
       ['Australia', 'NSW', 'Newcastle', 250, 2.0, 125.0],
       ['Australia', 'Victoria', 'Melbourne', 300, 1.0, 150.0],
       ['SA', 'Gauteng', 'Johannesburg', 300, 1.0, 150.0],
       ['SA', 'Western Cape', 'Cape Town', 200, 2.0, 100.0],
       ['India', 'Delhi', 'Delhi', 100, 3.0, 50.0],
       ['India', 'UP', 'Noida', 50, 4.0, 25.0]], dtype=object)

In [264]:
dict(a=5,b=6)

{'a': 5, 'b': 6}

In [265]:
round(6.5)

6

In [266]:
round(7.5)

8

In [8]:
df

      country         state          city  sales
0       India            MP        Indore    150
1       India            MP        Bhopal    200
2       India            MP      Jabalpur    100
3       India            UP       Lucknow    100
4   Australia           NSW        Sydney    200
5   Australia           NSW     Newcastle    250
6   Australia      Victoria     Melbourne    300
7          SA       Gauteng  Johannesburg    300
8          SA  Western Cape     Cape Town    200
9       India         Delhi         Delhi    100
10      India            UP         Noida     50

In [12]:
df.groupby(['country']).filter(lambda x: x['sales'].mean() > 200)

     country         state          city  sales
4  Australia           NSW        Sydney    200
5  Australia           NSW     Newcastle    250
6  Australia      Victoria     Melbourne    300
7         SA       Gauteng  Johannesburg    300
8         SA  Western Cape     Cape Town    200

In [13]:
a = pd.DataFrame({"name": ['Abhishek', 'Shrasti', 'Anvit']
                  ,"physics": [99, np.NaN, 95]
                  ,"maths": [100, 60, 99] })

In [24]:
a[a.isnull().any(axis=1)]

      name  physics  maths
1  Shrasti      NaN     60

In [64]:
b = pd.DataFrame(a.isnull().sum()).reset_index()
b.columns = ['index','value']
b[b.value > 0]

     index  value
1  physics      1

In [69]:
a[a.isnull().any(axis=1)]

      name  physics  maths
1  Shrasti      NaN     60

In [81]:
a.isnull().sum() > 0

name       False
physics     True
maths      False
dtype: bool

In [73]:
?pd.DataFrame.sort_values

In [84]:
a.columns[a.isnull().sum() > 0]

Index(['physics'], dtype='object')